# Pandas Tutorial

In [1]:
import numpy as np 
import pandas as pd

In [2]:
labels = ['a', 'b', 'c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [44]:
labels

['a', 'b', 'c']

In [4]:
pd.Series(data = my_data)

0    10
1    20
2    30
dtype: int64

In [45]:
pd.Series(data =my_data, index = labels)

a    10
b    20
c    30
dtype: int64

In [6]:
pd.Series(my_data,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(d) # It takes the keys in dictionary as index of Series And Values actually the 
             # The data points

a    10
b    20
c    30
dtype: int64

In [2]:
# Pandas Series can hold all type of data and objects in python

In [9]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [10]:
pd.Series(data = [print,sum,len])

0    <built-in function print>
1      <built-in function sum>
2      <built-in function len>
dtype: object

In [11]:
# index are used for allowns of fastly lookup data and works like hash table and dictionary

In [12]:
ser1 = pd.Series([1,2,3,4],['Chinchawad','Gandhinagar','Valivade','Kolhapur'])

In [13]:
ser2 = pd.Series([1,2,5,4],['Chinchawad','Gandhinagar','Mudshingi','Kolhapur'])

In [14]:
ser1

Chinchawad     1
Gandhinagar    2
Valivade       3
Kolhapur       4
dtype: int64

In [15]:
#How to grab all data points from a data set in series
ser1['Chinchawad']

1

In [16]:
ser2['Mudshingi']

5

In [17]:
ser3 = pd.Series(labels)

In [18]:
ser3

0    a
1    b
2    c
dtype: object

In [19]:
ser1+ser2 # it will match the index and perform the operation

Chinchawad     2.0
Gandhinagar    4.0
Kolhapur       8.0
Mudshingi      NaN
Valivade       NaN
dtype: float64

# Pandas DataFrames

In [20]:
# Creation of dataframe

In [21]:
np.random.seed(101)

In [22]:
df = pd.DataFrame(np.random.randn(5,4),['M','N','O','P','Q'],['A','B','C','D'])

In [50]:
df

          A         B         C         D
M  2.706850  0.628133  0.907969  0.503826
N  0.651118 -0.319318 -0.848077  0.605965
O -2.018168  0.740122  0.528813 -0.589001
P  0.188695 -0.758872 -0.933237  0.955057
Q  0.190794  1.978757  2.605967  0.683509

In [24]:
# index operations in dataframe

In [54]:
df['A']

M    2.706850
N    0.651118
O   -2.018168
P    0.188695
Q    0.190794
Name: A, dtype: float64

In [55]:
type(df['A'])

pandas.core.series.Series

In [56]:
type(df)

pandas.core.frame.DataFrame

In [57]:
df[['A','B']]  # for retriving multiple colums

          A         B
M  2.706850  0.628133
N  0.651118 -0.319318
O -2.018168  0.740122
P  0.188695 -0.758872
Q  0.190794  1.978757

In [58]:
# create the new column
df['new'] = df['A'] + df['B']

In [30]:
df

          A         B         C         D       new
M  2.706850  0.628133  0.907969  0.503826  3.334983
N  0.651118 -0.319318 -0.848077  0.605965  0.331800
O -2.018168  0.740122  0.528813 -0.589001 -1.278046
P  0.188695 -0.758872 -0.933237  0.955057 -0.570177
Q  0.190794  1.978757  2.605967  0.683509  2.169552

In [31]:
df.drop('new',axis = 1,inplace=True)

In [32]:
df

          A         B         C         D
M  2.706850  0.628133  0.907969  0.503826
N  0.651118 -0.319318 -0.848077  0.605965
O -2.018168  0.740122  0.528813 -0.589001
P  0.188695 -0.758872 -0.933237  0.955057
Q  0.190794  1.978757  2.605967  0.683509

In [33]:
# Selecting rows from dataframe

In [59]:
df

          A         B         C         D       new
M  2.706850  0.628133  0.907969  0.503826  3.334983
N  0.651118 -0.319318 -0.848077  0.605965  0.331800
O -2.018168  0.740122  0.528813 -0.589001 -1.278046
P  0.188695 -0.758872 -0.933237  0.955057 -0.570177
Q  0.190794  1.978757  2.605967  0.683509  2.169552

In [35]:
df.loc['O'] # loc for location and directly put the value

A   -2.018168
B    0.740122
C    0.528813
D   -0.589001
Name: O, dtype: float64

In [36]:
df.iloc[2] # iloc for index location and put the index you want to retrive that row

A   -2.018168
B    0.740122
C    0.528813
D   -0.589001
Name: O, dtype: float64

In [37]:
df.loc[['M','N']]

          A         B         C         D
M  2.706850  0.628133  0.907969  0.503826
N  0.651118 -0.319318 -0.848077  0.605965

In [38]:
# To find the particular values 
df

          A         B         C         D
M  2.706850  0.628133  0.907969  0.503826
N  0.651118 -0.319318 -0.848077  0.605965
O -2.018168  0.740122  0.528813 -0.589001
P  0.188695 -0.758872 -0.933237  0.955057
Q  0.190794  1.978757  2.605967  0.683509

In [39]:
df.loc[['M','N'],['A','B']]

          A         B
M  2.706850  0.628133
N  0.651118 -0.319318

In [40]:
df

          A         B         C         D
M  2.706850  0.628133  0.907969  0.503826
N  0.651118 -0.319318 -0.848077  0.605965
O -2.018168  0.740122  0.528813 -0.589001
P  0.188695 -0.758872 -0.933237  0.955057
Q  0.190794  1.978757  2.605967  0.683509

In [41]:
df.loc['O','C']

0.5288134940893595

In [42]:
df.shape

(5, 4)